#include "solveBaekjoon.h"

int getPeople(int k,int n) {
	if (n == 1)	// nÃþ 1È£ÀÌ¸é 1À» ¸®ÅÏ
		return 1;
	if (k == 0) { // 0ÃþÀÌ¸é È£¼ö°¡ »ç¶÷¼öÀÌ´Ï ¸®ÅÏ
		return n;
	}
	return (getPeople(k - 1, n) + getPeople(k, n - 1));
}

void baekjoon::p10250() {
	int t;		// Test case
	cin >> t;
	int k, n;	// Ãþ, È£¼ö
	for (int i = 0; i < t; i++) {
		cin >> k >> n;
		cout << getPeople(k, n) << '\n';
	}
}


/*
	aÃþ bÈ£
	a-1(¾Æ·¡Ãþ)ÀÇ 1È£ºÎÅÍ bÈ£±îÁö »ç¶÷µéÀÇ ÇÕ¸¸Å­
	µ¥·Á¿Í¶ó...

	kÃþ nÈ£¿¡´Â ¸î¸íÀÌ »ì°íÀÖ´Â°¡ 

	2ÄÉÀÌ½º
	1 k Ãþ
	3 n 3È£
	2Ãþ
	3È£

	0Ãþ iÈ£¿¡´Â i¸í
	k == 0ÀÌ°í nÀº 5ÀÏ¶§ 5¸íÀÌ »ê´Ù.
	(0Ãþ 5È£)
	1Ãþ 1È£¿¡´Â 1¸íÀÌ »ê´Ù
	0Ãþ 1È£±îÁöÀÇ »ç¶÷µéÀÇ ¼ö = 1¸í
	(1Ãþ 1È£)
	1Ãþ 2È£
	0Ãþ 1È£+2È£ = 3¸í
	
	1Ãþ 3È£
	0Ãþ 1È£+2È£+3È£ = 6¸í

	2Ãþ 1È£	
	1Ãþ 1È£ = 0Ãþ 1È£ = 1¸í
	
	2Ãþ 2È£
	1Ãþ 1È£(1)+2È£(3) = 0Ãþ 1È£+2È£ = 4

	2Ãþ 3È£
	1Ãþ 1È£ºÎÅÍ 3È£±îÁö ÇÕ
	= 0Ãþ 1È£ + 0Ãþ1~2È£ + 0Ãþ 1~3È£

	kÃþÀÇ nÈ£´Â
	k-1ÃþÀÇ 1È£~nÈ£ÀÇ sum

	= k-1ÃþÀÇ nÈ£ ÇÕ + kÃþÀÇ n-1È£ ÇÕ(k-1Ãþ 1~n-1È£)
*/